// for loop ব্যবহার করার জন্য প্রথমে for লিখতে হবে। তারপর variable লিখতে হবে এবং বলতে হবে কত নাম্বার থেকে loop শুরু হবে। তারপর বলতে হবে কত নাম্বার পর্যন্ত loop চলবে। এবং শেষে বলতে হবে কত করে করে loop বারবে বা কমবে। তারপর দ্বিতীয় ব্র্যাকেট এর মধ্যে data print করতে হবে। 

/////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\/////////////////////////////////////

for (var z = 1; z <= 15; z = z + 1){
  document.write(" Sajeb Chakraborty ");
}

// শুধুমাত্র  Sajeb Chakraborty নাম ১৫ বার print করবে . 

//////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\////////////////////////////////////


for (var k = 1; k <= 10; k = k + 1){
  document.write(" " + k);
}
// ১ থেকে ১০ পর্যন্ত সংখ্যা print করবে ।  

/////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////

for (var y = 1; y <=31; y = y + 2){
  document.write("{" + y +"}");
}
//  ১ থেকে ৩১ পর্যন্ত শুধুমাত্র বিজোড় সংখ্যা print করবে। 

//////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


for (var y = 2; y <= 30; y = y + 2){
  document.write(" ( " +  y + " )" );
}
//  ১ থেকে ৩০ পর্যন্ত শুধুমাত্র জোড় সংখ্যা print করবে। 

///////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


for (var p = 10; p >=1; p = p - 1){
  document.write(" [ " + p + " ] ");
}

// ১০ থেকে ১ পর্যন্ত ১ করে করে কমবে ।

////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


for (var l = 20; l >=1; l = l - 2){
  document.write(" < " + l + " > ");
}

// ২০ থেকে ১ পর্যন্ত ২ করে করে কমবে ।

////////////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


var inp1 = parseInt (prompt("Enter Fist Number : "))
var inp2 = parseInt (prompt("Enter Second Number : "))

var sum1 = inp1 + inp2
var sum2 = inp1 - inp2
var sum3 = inp1 * inp2
var sum4 = inp1 / inp2

document.write(sum1 + "<br>" , sum2 + "<br>", sum3 + "<br>", sum4 + "<br>");

// এখানে user দুইটা সংখ্যা input সেই দুই সংখ্যা প্রথমে যোগ হবে তারপর বিয়োগ হবে তারপর গুন হবে তারপর ভাগ হবে। 


/////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

var bee = parseInt (prompt("Enter First Number "))
var flower = parseInt (prompt("Enter Second Number : "))

var honey = 0;

for( var p = bee ; p < flower; p = p + 1 ){
  honey = honey + p ;
}
document.write(honey);

// এখানে user যে প্রথম value input দিবে তার দ্বিতীয় value  পর্যন্ত মোট যোগফল দেখাবে। 


///////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////\\\\\\\\\\\\\\\\\\///////////////