//////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////////////////


for (var s = 3; s < 8; s++) {
  document.write(" for " + s + '<br>');  // for loop
}

//////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////////////////



var a = 5; 
while(a <= 10){
  document.write(" while "+ a + '<br>')   // while loop 
  a++
}

//////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////////////////

var c = 10;
do{
  document.write( " do while " +  c + '<br>')  // do while loop
  c++
}
while(c <= 15); 

// do while loop লিখার ক্ষেত্রে প্রথমে একটি variable বলে নিতে হবে।  তারপর do keyword টি ব্যবহার করতে হবে।  তারপর দ্বিতীয় ব্র্যাকেট এর মধ্যে variable টি print করতে হবে। তারপর do এর body র মধ্যে update লিখতে হবে। তারপর while keyword এর মধ্যে condition টি লিখতে হবে। 


//////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////////////////
