//////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


for(s = 1; s <= 15; s++){
  document.write(" " + s )
  
}

//////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


// ওপরের উদাহরণ হল for loop এর এর নিচের উদাহরণটি হল while loop এর।  for loop এ  startvalue , condition এবং update value একসাথে থাকে। কিন্তু while loop এর ক্ষেত্রে value গুলো একসাথে থাকে না।  while loop এর ক্ষেত্রে প্রথমে start value দিতে হবে । তারপর while keyword ব্যবহার করতে হবে। তারপর condition বলতে হবে। তারপর print করতে হবে। এবং update part টি থাকবে while loop এর body র মধ্যে।  


var b = 1;

while(b <= 25 ){
  document.write(" "+b)
  b++;
}


////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\


var i = 2;
while(i <= 20){
  i=i + 2
  document.write(" while "+ i)


}


////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

var i = 20;
while(i >= 2){
  i = i - 2
  document.write(" Reverse  " + i)

}

////////////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\